{
  "backend/main.mo": "Defines the backend actor and all core data models for tasks, users, transactions, ads, ratings, and activity logging.",
  "backend/migration.mo": "Contains migration logic that upgrades stored user roles by adding the new Business role while preserving existing data.",
  "feature_evidence.json": "Lists feature evidence records mapping features to modified files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten one-line summaries for key frontend files used across the project.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes including light/dark mode color tokens.",
  "frontend/index.html": "Base HTML entry document that loads the React app via main.tsx.",
  "frontend/public/.nojekyll": "Prevents GitHub Pages from applying Jekyll processing to the public folder.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown routes to root while preserving the original path.",
  "frontend/scripts/README.md": "Explains the purpose and usage of the draft URL verification script.",
  "frontend/scripts/verify-draft-url.example.env": "Example environment file showing how to configure a draft URL for verification.",
  "frontend/scripts/verify-draft-url.mjs": "Node script that verifies deployed draft URLs by checking HTTP responses, HTML structure, and deep link handling.",
  "frontend/src/App.tsx": "Defines the root component and configures all app routes, handling authentication state and role-based redirection.",
  "frontend/src/components/ads/AdInterstitial.tsx": "Displays an interstitial ad with a countdown timer before allowing the user to continue.",
  "frontend/src/components/ads/AdPlacementBanner.tsx": "Shows a banner-style ad placement for a given ad type once loaded.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with role-based navigation, user menu, and routing outlet.",
  "frontend/src/components/tasks/PostedByLabel.tsx": "Fetches and displays the provider’s name for a task, falling back to a truncated ID if unavailable.",
  "frontend/src/components/tasks/StatusBadge.tsx": "Renders a color-coded badge representing the task’s current status.",
  "frontend/src/components/tasks/TaskCard.tsx": "Displays a task summary with status, details, provider info, and an optional accept button for students.",
  "frontend/src/components/transactions/TransactionHistoryTable.tsx": "Shows a table of financial transactions with formatted dates, amounts, and type indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication with AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, task, verification, withdrawal, and ad data via the actor API with identity integration and toasts.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark theme CSS variables for colors, spacing, and UI elements.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin/ActivityLogsPage.tsx": "Displays a table of system activity logs with admin-only access, formatting timestamps and action labels.",
  "frontend/src/pages/Admin/AdminDashboardPage.tsx": "Shows admin dashboard stats including verifications, tasks, withdrawals, and commission totals with quick navigation actions.",
  "frontend/src/pages/Admin/AdsSettingsPage.tsx": "Admin page for viewing and editing ad placements, allowing updates to ad content and frequency with role-based access control.",
  "frontend/src/pages/Admin/AllUsersPage.tsx": "Admin-only page that checks user role and displays a placeholder card for future user management features.",
  "frontend/src/pages/Admin/CommissionEarningsPage.tsx": "Admin-only page showing platform commission info and a placeholder section for detailed earnings analytics.",
  "frontend/src/pages/Admin/SystemStatsPage.tsx": "Admin-only dashboard page that will display system performance metrics and analytics.",
  "frontend/src/pages/Admin/TaskCompletionPage.tsx": "Loads all tasks awaiting proof review and lets admins approve or reject them, with payment distribution logic.",
  "frontend/src/pages/Admin/TaskModerationPage.tsx": "Displays tasks pending approval and allows admins to approve them, with a future option for rejection.",
  "frontend/src/pages/Admin/VerificationReviewPage.tsx": "Lists pending student verification requests and allows admins to approve or reject each with document review.",
  "frontend/src/pages/Admin/WithdrawalRequestsPage.tsx": "Shows pending withdrawal requests and lets admins approve or reject them with wallet deduction handling.",
  "frontend/src/pages/Auth/AuthLandingPage.tsx": "Renders the authentication landing page with Internet Identity login and a profile setup dialog for new users.",
  "frontend/src/pages/Provider/CreateTaskPage.tsx": "Provides a form for task posters and businesses to create tasks, validating deposit balance before submission.",
  "frontend/src/pages/Provider/ProviderDashboardPage.tsx": "Displays provider stats, tasks, deposit management, and transaction history with navigation to create new tasks.",
  "frontend/src/pages/Student/MyTasksPage.tsx": "Shows a student's active and completed tasks filtered from all tasks, with loading and empty states.",
  "frontend/src/pages/Student/StudentDashboardPage.tsx": "Displays student stats and lists available tasks, along with wallet info and dashboard ads.",
  "frontend/src/pages/Student/StudentProfilePage.tsx": "Allows students to view and edit profile details and shows wallet balance and role information.",
  "frontend/src/pages/Student/TransactionHistoryPage.tsx": "Displays a student's transaction history using a query hook and shows a loading card or a transactions table.",
  "frontend/src/pages/Student/WalletPage.tsx": "Shows wallet balance, allows submitting withdrawal requests with validation, and lists recent transactions.",
  "frontend/src/pages/Tasks/TaskDetailsPage.tsx": "Loads and displays task details, handles accepting tasks, uploading proof, and admin review actions with progress tracking.",
  "frontend/src/utils/formatInr.ts": "Formats numbers or bigints into INR strings and safely converts bigint to number for UI display.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, and container settings.",
  "project_state.json": "Defines the current project state, architecture constraints, feature requirements, and upgrade guidelines for the system."
}