{
  "kind": "build_request",
  "title": "Enable in-app wallet deposits and withdrawals",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement and/or verify a working wallet deposit flow that allows eligible roles (TaskPoster and Business) to add money to their in-app wallet balance in INR (₹), persists the updated balance, and records a deposit transaction in transaction history.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want deposit and withdraw money inside the app"
        ]
      },
      "acceptanceCriteria": [
        "A TaskPoster/Business user can enter a deposit amount and submit it from the UI, and their deposit balance increases immediately after success.",
        "A Student user cannot deposit (backend enforces this and the UI does not expose deposit actions to Students).",
        "Each successful deposit creates a persisted transaction record of type Deposit, visible in the user’s transaction history table."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement and/or verify a working wallet withdrawal flow that allows a Student to request a withdrawal from their in-app wallet balance, persists the withdrawal request, and allows an Admin to approve/reject the request; on approval, the Student wallet balance is debited and a withdrawal transaction is recorded.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want deposit and withdraw money inside the app"
        ]
      },
      "acceptanceCriteria": [
        "A Student can submit a withdrawal request from the Wallet page, and the request is persisted.",
        "An Admin can see pending withdrawal requests in the Admin Withdrawals screen and approve or reject them.",
        "When an Admin approves a withdrawal, the student’s wallet balance decreases by the requested amount and a persisted Withdrawal transaction appears in the student’s transaction history.",
        "If an Admin rejects a withdrawal, the student’s wallet balance is not debited."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure transaction history retrieval and display supports showing deposit and withdrawal records for the current user with correct INR formatting and correct credit/debit indicators.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want deposit and withdraw money inside the app"
        ]
      },
      "acceptanceCriteria": [
        "Transaction history loads without errors for both Student and Provider roles.",
        "Deposit transactions are displayed as credits and Withdrawal transactions are displayed as debits.",
        "All transaction amounts are displayed with INR (₹) formatting consistently across wallet and transaction history screens."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Integrating real payment gateways, UPI collection, bank transfers, or any external payment processor.",
    "Implementing refunds/chargebacks or multi-currency support.",
    "Adding new roles or changing the existing task escrow/payment split logic beyond what is required for deposit/withdraw flows."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}