{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable in-app wallet deposits, withdrawals, and transaction history display (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide a deposit flow UI for TaskPoster/Business users that triggers backend deposit, refreshes balances immediately, and does not expose deposits to Students.",
      "acceptanceCriteria": [
        "A TaskPoster/Business user can enter a deposit amount and submit it from the UI, and their deposit balance increases immediately after success.",
        "A Student user cannot deposit (backend enforces this and the UI does not expose deposit actions to Students).",
        "Each successful deposit creates a persisted transaction record of type Deposit, visible in the user’s transaction history table."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Provider/ProviderDashboardPage.tsx",
          "operation": "modify",
          "description": "Use the authorization component’s role-based access control signals (via existing role/appRole query hooks) to ensure only TaskPoster/Business users can see and use the Deposit Funds form; for non-provider roles, hide deposit actions and render an access-denied/redirect UI state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify deposit mutation success handling keeps the UI in sync (invalidate/refresh deposit balance + transaction history queries) so the deposit balance increases immediately after success and the Deposit record appears in transaction history. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Support student withdrawal request submission from the Wallet page and admin approval/rejection from the Admin Withdrawals screen, with UI updates after approval/rejection.",
      "acceptanceCriteria": [
        "A Student can submit a withdrawal request from the Wallet page, and the request is persisted.",
        "An Admin can see pending withdrawal requests in the Admin Withdrawals screen and approve or reject them.",
        "When an Admin approves a withdrawal, the student’s wallet balance decreases by the requested amount and a persisted Withdrawal transaction appears in the student’s transaction history.",
        "If an Admin rejects a withdrawal, the student’s wallet balance is not debited."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Student/WalletPage.tsx",
          "operation": "modify",
          "description": "Use the authorization component’s role-based access control signals (via existing role/appRole query hooks) to ensure only Student users can see and submit the withdrawal request form; for other roles, hide the withdrawal action and show an access-denied/redirect UI state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the withdrawal request mutation invalidates the correct cached queries used by admin and user views (e.g., pending withdrawals list for admins and any relevant wallet/transaction queries on approval) so admin decisions propagate to wallet balance and transaction history. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Admin/WithdrawalRequestsPage.tsx",
          "operation": "modify",
          "description": "Improve Admin Withdrawals UI to consistently format INR amounts using the shared formatter, and keep approve/reject actions responsive with clear loading/disabled states and graceful error messaging (from existing toast/mutation handlers). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display transaction history for the current user with consistent INR formatting and correct credit/debit indicators for deposits and withdrawals.",
      "acceptanceCriteria": [
        "Transaction history loads without errors for both Student and Provider roles.",
        "Deposit transactions are displayed as credits and Withdrawal transactions are displayed as debits.",
        "All transaction amounts are displayed with INR (₹) formatting consistently across wallet and transaction history screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/transactions/TransactionHistoryTable.tsx",
          "operation": "modify",
          "description": "Verify deposit/withdrawal credit/debit indicators and signage are correct and consistently applied; ensure all amounts use the shared INR formatter and remain consistent across pages using this table. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Student/TransactionHistoryPage.tsx",
          "operation": "modify",
          "description": "Verify transaction history loading/error states work for authenticated users and that the table is the single source of formatting/indicators; adjust page copy or guard behavior only as needed to ensure reliable load without UI errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Provider/ProviderDashboardPage.tsx",
          "operation": "modify",
          "description": "Verify the provider dashboard transaction history section renders deposit transactions as credits and withdrawal transactions as debits using the shared table and INR formatting for consistency. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}